[{
    "id": "1",
    "title": "Mobile London Nodejs",
    "thumbnail": "img\/projects\/thumbnails\/mobilelondon.png",
    "image": "img\/projects\/mobilelondon.png",
    "date": "2013-05-13 12:27:58",
    "text": "This project was completed for my dissertation which I recieved a first. My finished dissertation document can be found <a href=\"\/documents\/Mobile London - A mobile website for planning journeys in London.pdf\">here in PDF format<\/a>. Mobile London was created with <a href=\"http:\/\/nodejs.org\/\" target=\"_blank\" title=\"Node.js\">Node.js<\/a>, <a href=\"http:\/\/expressjs.com\/\" target=\"_blank\" title=\"Expressjs\">Express<\/a>, HTML5, <a href=\"http:\/\/jquery.com\/\" title=\"jQuery\" target=\"_blank\">jQuery<\/a> and <a href=\"http:\/\/jquerymobile.com\/\" target=\"_blank\" title=\"jQuery Mobile\">jQuery Mobile<\/a>; which provides users \neasy access to information provided by Transport For London (TFL) while travelling around London via public transport whilst using a smartphone or tablet device.\n<br \/><br \/>\nThe web application was created to work on all mobile devices which support HTML5 however, optimised for iOS.",
    "url": "http:\/\/mobilelondon.org",
    "published": "0"
}, {
    "id": "8",
    "title": "IMProve Training Ltd",
    "thumbnail": "img\/projects\/thumbnails\/improve.png",
    "image": "img\/projects\/improve.png",
    "date": "2013-05-12 18:08:10",
    "text": "<p>\r\n    The objective for this project was to create a simple website for the company IMProve Training Limited, in order to provide information on what the company does, who they are, their clients and how to contact the company.\r\n<\/p>\r\n<p>\r\n    The site was created with CodeIgniter, Compass and Bower.\r\n<\/p>",
    "url": "http:\/\/improvetraininglimited.co.uk",
    "published": "0"
}, {
    "id": "7",
    "title": "Mentos Money Maker",
    "thumbnail": "img\/projects\/thumbnails\/mentosmoneymaker.png",
    "image": "img\/projects\/mentosmoneymaker.png",
    "date": "2013-04-22 14:54:27",
    "text": "<p>The objective of this Facebook application was to create a web interface for <a href=\"http:\/\/on.fb.me\/15TNnvd\">Mentos UK<\/a>. Which were launching a new competition called <a href=\"http:\/\/on.fb.me\/15TNjeO\">Shake Your Money Maker<\/a>.<\/p>\n\n<p>The site will allow competition participants to enter their codes found on various different Mentos product wrappers, and play a Flash game in which you shake the product using a webcam to increase a power bar.<\/p>\n\n<p>To complete this project it was created using <a href=\"http:\/\/bit.ly\/15TNPtq\">CodeIgniter<\/a>, <a href=\"http:\/\/bit.ly\/15TNVRN\">Compass<\/a>, <a href=\"http:\/\/bit.ly\/15TO0oC\">GruntJs<\/a> and <a href=\"http:\/\/bit.ly\/15TO6wu\">CoffeeScript<\/a>.<\/p>\n\n<p>For this project my work was mainly working on the front-end CSS using Compass and the back-end CodeIgniter PHP. With some work with CoffeeScript where needed.<\/p>",
    "url": "http:\/\/on.fb.me\/15TNjeO",
    "published": "0"
}, {
    "id": "5",
    "title": "Better World Walk",
    "thumbnail": "img\/projects\/thumbnails\/betterworldwalk.png",
    "image": "img\/projects\/betterworldwalk.png",
    "date": "2013-02-24 14:54:27",
    "text": "<p>The aim of this project was to provide employees within Ethicon EMEA (J&amp;J) access to view information about an internal fund raising exercise. A number of Ethicon employees collectively are walking to South Africa (using pedometers).<\/p>\n<p>The site will allow participants to enter their amount of foot steps which will equal Kilometres. Depending on the amount of Kilometres entered, the background will change stating where they currently are going from Paris to South Africa.<\/p>\n<p>The site was created using the <a href=\"http:\/\/www.yiiframework.com\/\" target=\"_blank\">Yii Framework<\/a> using <a href=\"twitter.github.com\/bootstrap\/\" target=\"_blank\">Twitter Bootstrap<\/a> for the mobile site. On the Desktop site, the home page has been created using <a href=\"http:\/\/johnpolacek.github.com\/scrollorama\/\" target=\"_blank\">Scrollorama<\/a> allowing the user to scroll down the page and basically walk down a road providing more information of the site.<\/p>\n<p>My work on this project was purely as developer, working on front-end JavaScript\/jQuery with work on the Parallax of the site. Whilst also working on the server-side PHP for such things as the events, and a Cronjob run every hour running a simple page scraper to update how much had been raised whilst looking at the OperationSmile site. Other than this I worked on the mobile site myself working with Twitter Bootstrap but run as a complete different Yii theme rather than a responsive site.<\/p>",
    "url": "http:\/\/betterworldwalk.com",
    "published": "0"
}, {
    "id": "3",
    "title": "Learning Journey",
    "thumbnail": "img\/projects\/thumbnails\/learningjourney.png",
    "image": "img\/projects\/learningjourney.png",
    "date": "2012-12-04 13:16:30",
    "text": "The aim of this project was to provide employees within Vision Care (J&J) access to downloadable materials and planning functionality to track their development in their role. Vision Care provide new employees with documents and a schedule of meetings and courses, with information about when they should be completed during their entire induction. Once their induction is completed they should be allowed, allowing ongoing training (the same as existing employees). \n<br \/><br \/>\nManagers of the learners use the tool to oversee the development of their reports with a view of learners' progress of inductions and ongoing training sections. \n<br \/><br \/>\nThis project was created using the Yii framework for PHP. My role on this project was Development Lead. In this capacity I worked on the IA\/Requirement gathering, working with the wireframers to ensure that the final product met the main requirements and objectives of the project. \n<br \/><br \/>\nI also worked on build of the project, working mainly on the front-end JavaScript, HTML and CSS styling. Throughout the project I ensured that the project was on track and meeting the needs of the client and stakeholders, as well as liaising with account and project managers, clients and also the developers working on the project.",
    "url": "http:\/\/mylearningjourney.acuvue.co.uk\/",
    "published": "0"
}, {
    "id": "4",
    "title": "RSSB RRUKA",
    "thumbnail": "img\/projects\/thumbnails\/RSSBRruka.png",
    "image": "img\/projects\/RSSBRruka.png",
    "date": "2012-12-03 13:16:30",
    "text": "The aim of this project was to take an already existing wordpress site which had been built with an old version, using the default wordpress theme. Update the version of wordpress and create \na personalised theme using the companys branding colours.\n<br \/><br \/>\nThe main point of this site was to create different news items and post content types as well as an events section with suggestions and liking options.  My role and responsibilities for this \nproject was to ensure that the build requirements and suggestions were possible, and the site was built on track with deadlines. As development lead I created the functional requirements \nand outlined how the build should be carried, out as well as working on the development.",
    "url": "http:\/\/rruka.org.uk\/",
    "published": "0"
}, {
    "id": "2",
    "title": "I Am Ethicon",
    "thumbnail": "img\/projects\/thumbnails\/IamEthiconAwards.png",
    "image": "img\/projects\/IamEthiconAwards.png",
    "date": "2012-12-03 09:21:06",
    "text": "This was an employee engagement campaign for the European section of Ethicon. It was later heralded as \"the\" way to bring employees together and considered a benchmark initiative within the company. \n<br \/><br \/>\nThis site was built on SharePoint 2007 publishing platform. Despite this limitation, the aim was to make this feel more like a web application. In order to meet this, I implemented jQuery and AJAX and a jQuery plugin, SPServices. This plugin allowed for a lot of customisation linking, custom lists, with columns allowing users to like and comment on nominations.\n<br \/><br \/>\nMy work on this SharePoint application took place whilst on work experience placement at Content Formula. My role on this project was to check wireframes matched the requirements, and to ensure that what was proposed was feasible using the plugin as well as lead the overall project build. I produced the functional specifications for how to build the system. Following this, I led the development effort, building all of the functionality on the SharePoint front-end.",
    "url": "",
    "published": "0"
}, {
    "id": "6",
    "title": "SmartTouch",
    "thumbnail": "img\/projects\/thumbnails\/smarttouch.png",
    "image": "img\/projects\/smarttouch.png",
    "date": "2012-12-02 00:00:00",
    "text": "<p>The SmartTouch website was created to provide further information on BioSense Webster's product. The site was created using <a href=\"twitter.github.com\/bootstrap\/\" target=\"_blank\">Twitter Bootstrap<\/a>.<\/p>\n<p>It is a Repsonsive layout website which has been created as a single paged website, allowing the user to scroll (or swipe) down the page.<\/p>\n<p>For this project I worked as Developer lead, and created the Front-end HTML, CSS and jQuery\/JavaScript on the site. The server-side code was outsourced to be created on Drupal<\/p>",
    "url": "",
    "published": "0"
}]
